hamza-kaka/Solar-Inverter/app/mkv31/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM1CH0SRC_FTM 0x00u /*!<@brief FTM1 channel 0 input capture source select: FTM1_CH0 signal */
#define SOPT4_FTM2CH0SRC_FTM 0x00u /*!<@brief FTM2 channel 0 input capture source select: FTM2_CH0 signal */
#define SOPT4_FTM2CH1SRC_FTM 0x00u /*!<@brief FTM2 channel 1 input capture source select: FTM2_CH1 signal */

/*! @name PORTD0 (number 93), UH
  @{ */
#define BOARD_INITPINS_UH_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_UH_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                     /* @} */

/*! @name PORTD1 (number 94), UL
  @{ */
#define BOARD_INITPINS_UL_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_UL_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                     /* @} */

/*! @name PORTC8 (number 80), VH
  @{ */
#define BOARD_INITPINS_VH_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_VH_PIN 8U     /*!<@brief PORTC pin index: 8 */
                                     /* @} */

/*! @name PORTC9 (number 81), VL
  @{ */
#define BOARD_INITPINS_VL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_VL_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                     /* @} */

/*! @name PORTC10 (number 82), WH
  @{ */
#define BOARD_INITPINS_WH_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_WH_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                     /* @} */

/*! @name PORTC11 (number 83), WL
  @{ */
#define BOARD_INITPINS_WL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_WL_PIN 11U    /*!<@brief PORTC pin index: 11 */
                                     /* @} */

/*! @name PORTA12 (number 42), BST_CHNL_0
  @{ */
#define BOARD_INITPINS_BST_CHNL_0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_BST_CHNL_0_PIN 12U    /*!<@brief PORTA pin index: 12 */
                                             /* @} */

/*! @name PORTA13 (number 43), BST_CHNL_1
  @{ */
#define BOARD_INITPINS_BST_CHNL_1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_BST_CHNL_1_PIN 13U    /*!<@brief PORTA pin index: 13 */
                                             /* @} */

/*! @name ADC0_DP1 (number 14), I_PV_p
  @{ */
/* @} */

/*! @name ADC0_DM1 (number 15), I_PV_n
  @{ */
/* @} */

/*! @name ADC0_DP2 (number 16), I_INV_n
  @{ */
/* @} */

/*! @name ADC1_SE23 (number 28), I_INV_u
  @{ */
/* @} */

/*! @name ADC1_SE18 (number 26), I_INV_w
  @{ */
/* @} */

/*! @name ADC0_SE23 (number 27), I_INV_v
  @{ */
/* @} */

/*! @name PORTC4 (number 76), Fault_PS
  @{ */
#define BOARD_INITPINS_FLT_INV_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_FLT_INV_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_FLT_INV_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                          /* @} */

/*! @name PORTC0 (number 70), FAULT_AC_BST
  @{ */
#define BOARD_INITPINS_FLT_BST_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_FLT_BST_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_FLT_BST_PIN 0U     /*!<@brief PORTC pin index: 0 */
                                          /* @} */

/*! @name ADC1_DP3 (number 18), V_DC_p
  @{ */
/* @} */

/*! @name ADC1_DM3 (number 19), V_DC_n
  @{ */
/* @} */

/*! @name ADC1_DP0 (number 20), V_PV_p
  @{ */
/* @} */

/*! @name ADC1_DM0 (number 21), V_PV_n
  @{ */
/* @} */

/*! @name PORTE5 (number 6), test
  @{ */
#define BOARD_INITPINS_test_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_test_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_test_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                       /* @} */

/*! @name PORTB18 (number 64), AC_BST_1
  @{ */
#define BOARD_INITPINS_AC_BST_1_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_AC_BST_1_PIN 18U    /*!<@brief PORTB pin index: 18 */
                                           /* @} */

/*! @name PORTB19 (number 65), AC_BST_2
  @{ */
#define BOARD_INITPINS_AC_BST_2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_AC_BST_2_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                           /* @} */

/*! @name PORTB2 (number 55), relay
  @{ */
#define BOARD_INITPINS_relay_rect_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_relay_rect_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_relay_rect_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
